<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"08bff24f9db0a49cd7d1318cd4d82588ba1462e14f555e667c1b9d29cc775525","plan_job_ref":"Job Plan Airflow DAGs #247 at https://github.com/cal-itp/data-infra/actions/runs/16209351221","plan_out_hash":"0967100ebf491c60c84bf437ea96487055d594e61eb4d0831120ea0a7524cdc5","plan_hash":"1ea1a34edd32b817dc1ced22b21d42e956e84ec1e9dd30c336c268c9d7d9d34c","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "0MvR1A==" -> (known after apply)
!~      detect_md5hash      = "ywugIlUZagDiCHTvCgCd/A==" -> "different hash"
!~      generation          = 1752188818639284 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "ywugIlUZagDiCHTvCgCd/A==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "5rnSGw==" -> (known after apply)
!~      detect_md5hash      = "S7QmrKUvBe0feksd/+70Ww==" -> "different hash"
!~      generation          = 1752188820132103 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "S7QmrKUvBe0feksd/+70Ww==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "KvxdLg==" -> (known after apply)
!~      detect_md5hash      = "kh10Bt2VtvG+0yNnA5q1/Q==" -> "different hash"
!~      generation          = 1752103419390838 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "kh10Bt2VtvG+0yNnA5q1/Q==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #247](https://github.com/cal-itp/data-infra/actions/runs/16209351221)